309.1_CE311_Spring2025.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-02-04 Tue 07:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CE 311: Design of Reinforced Concrete Structures - Spring 2025</title>
<meta name="generator" content="Org Mode" />

<link rel='stylesheet' href='gs_simple.css' />
</head>
<body>
<div id="preamble" class="status">

<center>
<nav>
<a href="/index.html">Home</a>
<a href="/research.html">Research</a>
<a href="/teaching.html">Teaching</a>
<a href="/students.html">Students</a>
</nav>
</center>
</div>
<div id="content" class="content">
<h1 class="title">CE 311: Design of Reinforced Concrete Structures - Spring 2025</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0c9de23">Basic Information</a></li>
<li><a href="#org12c9af6">Course objectives, syllabus, books, pre-requisites</a></li>
<li><a href="#orgdeb123e">Course Policies</a></li>
<li><a href="#org2c46232">Calendar (tentative)</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0c9de23" class="outline-2">
<h2 id="org0c9de23">Basic Information</h2>
<div class="outline-text-2" id="text-org0c9de23">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">Theory</th>
<th scope="col" class="org-left">Laboratory</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Class time</td>
<td class="org-left">Wednesday, Friday, 10:00-11:20 hrs</td>
<td class="org-left">Thursday, 15:30-16:50 hrs</td>
</tr>

<tr>
<td class="org-left">Class location</td>
<td class="org-left">AB 7/101</td>
<td class="org-left">AB 6/102</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Instructor</td>
<td class="org-left">Gaurav Srivastava (gauravs@iitgn.ac.in)</td>
<td class="org-left">Siva Chopperla (siva.chopperla@iitgn.ac.in)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Tutorial time</td>
<td class="org-left">Thursday, 17:00-18:20 hrs</td>
<td class="org-left">Thursday, 17:00-18:20 hrs</td>
</tr>

<tr>
<td class="org-left">Tutorial location</td>
<td class="org-left">AB 7/206</td>
<td class="org-left">AB 7/206</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">TAs</td>
<td class="org-left">Venkata Valligatla (venkata.valligatla@iitgn.ac.in)</td>
<td class="org-left">Sheikh Mayesser Mushtaq (sheikh.m@iitgn.ac.in)</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">Sreerag CS (24250094@iitgn.ac.in)</td>
<td class="org-left">Faizan Yousuf Bhat (24350009@iitgn.ac.in)</td>
</tr>
</tbody>
</table>
<p>
<b>Note</b>:
</p>
<ol class="org-ol">
<li>Tutorial hours will be used for problem-solving, covering theoretical aspects of the laboratory, and hands-on laboratory experiments, as relevant for the topics being covered.</li>
<li>The remainder of this website has information pertaining to the theory part of the course.</li>
<li>The laboratory part of the course will use a Google Classroom (Code: wg7cn6k). More information is available here (<a href="https://iitgnacin-my.sharepoint.com/:b:/g/personal/siva_chopperla_iitgn_ac_in/EXN5nsZQEQxGm6IeGD7rpGwBHYBSjKF5czc9GGqBC9-T4A?e=yZQSkb">link to PDF</a>).</li>
</ol>
</div>
</div>

<div id="outline-container-org12c9af6" class="outline-2">
<h2 id="org12c9af6">Course objectives, syllabus, books, pre-requisites</h2>
<div class="outline-text-2" id="text-org12c9af6">
</div>
<div id="outline-container-org42d590d" class="outline-3">
<h3 id="org42d590d">Objectives</h3>
<div class="outline-text-3" id="text-org42d590d">
<ul class="org-ul">
<li>To learn the fundamentals of analyzing reinforced concrete structural members.</li>
<li>To learn design of basic structural members of a reinforced concrete building.</li>
<li>To learn overall structual design of a reinforced concrete building.</li>
</ul>
</div>
</div>

<div id="outline-container-orgc0c27af" class="outline-3">
<h3 id="orgc0c27af">Syllabus</h3>
<div class="outline-text-3" id="text-orgc0c27af">
<ul class="org-ul">
<li>Properties of concrete and steel.</li>
<li>Design philosophies.</li>
<li>Loads and load combinations.</li>
<li>Analysis and design of beams, columns, slabs, stair case and shallow foundations.</li>
<li>Ductile detailing.</li>
<li>(if time permits: ) design of shear walls, seismic design.</li>
</ul>
</div>
</div>


<div id="outline-container-org215f2dd" class="outline-3">
<h3 id="org215f2dd">Textbook</h3>
<div class="outline-text-3" id="text-org215f2dd">
<ul class="org-ul">
<li>Reinforced Concrete Design - S Unnikrishna Pillai and Devdas Menon.</li>
</ul>
</div>
</div>

<div id="outline-container-org5af76f1" class="outline-3">
<h3 id="org5af76f1">Reference Book</h3>
<div class="outline-text-3" id="text-org5af76f1">
<ul class="org-ul">
<li>Limit State Design of Reinforced Concrete Structures - P C Verghese.</li>
</ul>
</div>
</div>

<div id="outline-container-org368832f" class="outline-3">
<h3 id="org368832f">Required codes</h3>
<div class="outline-text-3" id="text-org368832f">
<ul class="org-ul">
<li>IS 456(2000): Plain and reinforced concrete - Code of Practice</li>
<li>IS 875-1(1987): Code of practice for design loads (other than earthquake) for buildings and structures [Dead Loads]</li>
<li>IS 875-2(1987): Code of practice for design loads (other than earthquake) for buildings and structures [Imposed Loads]</li>
<li>IS 875-3(2015): Code of practice for design loads (other than earthquake) for buildings and structures [Wind Loads]</li>
<li>SP 16(1980): Design aids for reinforced concrete to IS 456</li>
</ul>

<p>
<b>Note</b>:
</p>
<ul class="org-ul">
<li>Please have a printed copy of the codes available during classes, tutorials and exams.</li>
<li>During the exams, only printed copies of the codes will be allowed.</li>
</ul>
</div>
</div>

<div id="outline-container-orge93b3f2" class="outline-3">
<h3 id="orge93b3f2">Pre-requisites</h3>
<div class="outline-text-3" id="text-orge93b3f2">
<ul class="org-ul">
<li>Good background in Mechanics of Solids.</li>
<li>Good background in Structural Analysis.</li>
<li>Curiosity to learn the fundamentals behind construction of some of the largest structures like Hoover Dam and Burj Khalifa.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgdeb123e" class="outline-2">
<h2 id="orgdeb123e">Course Policies</h2>
<div class="outline-text-2" id="text-orgdeb123e">
</div>
<div id="outline-container-org06c2721" class="outline-3">
<h3 id="org06c2721">Etiquette</h3>
<div class="outline-text-3" id="text-org06c2721">
<ul class="org-ul">
<li>Please be considerate about everyone's time.</li>
<li>In all emails pertaining to this course, please have "CE311" in the subject line.
<ul class="org-ul">
<li>(note that there is no space or hyphen or anything between CE and 311)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org6a0b950" class="outline-3">
<h3 id="org6a0b950">Cheating</h3>
<div class="outline-text-3" id="text-org6a0b950">
<p>
Cheating cases (assignments/codes/exams/project) will be dealt with in accordance with the Institute norms. It is expected that everyone will uphold the honor code.
</p>
</div>
</div>

<div id="outline-container-org066b369" class="outline-3">
<h3 id="org066b369">Grading</h3>
<div class="outline-text-3" id="text-org066b369">
<ul class="org-ul">
<li>Theory part comprises of 70% of the overall grading (remaining 30% is for laboratory)</li>
<li>Following will be the weightage of different components of assessment for the theory part</li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-left">Weightage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Homework assignments</td>
<td class="org-left">40%</td>
</tr>

<tr>
<td class="org-left">Exams (two)</td>
<td class="org-left">15% each</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org39aeec5" class="outline-3">
<h3 id="org39aeec5">Modes of formal assessment</h3>
<div class="outline-text-3" id="text-org39aeec5">
<ul class="org-ul">
<li>Assignments will involve two types of problems:
<ul class="org-ul">
<li>Set A: to be submitted for grading</li>
<li>Set B: to be practiced and will not be graded (this is treated as tutorial; help will be available from the TAs/instructor for solving, if needed)</li>
</ul></li>
<li>Exams will involve take home type analysis/design problems along with viva/presentations.</li>
<li>Expect one assignment per week.</li>
</ul>
</div>
</div>

<div id="outline-container-org662d1be" class="outline-3">
<h3 id="org662d1be">Emphasis on self-learning</h3>
<div class="outline-text-3" id="text-org662d1be">
<p>
It is important to develop the habit of self-learning. A number of reading assignments and self-exercises will be given during the course. These will not be formally graded and it will be expected that students will go through them on a regular basis on their own.
</p>
</div>
</div>
</div>

<div id="outline-container-org2c46232" class="outline-2">
<h2 id="org2c46232">Calendar (tentative)</h2>
<div class="outline-text-2" id="text-org2c46232">
</div>
<div id="outline-container-orga71eb4c" class="outline-3">
<h3 id="orga71eb4c">[L1] Jan 03, Fri</h3>
<div class="outline-text-3" id="text-orga71eb4c">
<ul class="org-ul">
<li>Introduction to design. Components of a building. Load path.</li>
</ul>
</div>
</div>
<div id="outline-container-orge737ebf" class="outline-3">
<h3 id="orge737ebf">[L2] Jan 08, Wed</h3>
<div class="outline-text-3" id="text-orge737ebf">
<ul class="org-ul">
<li>Characterization and estimation of loads.</li>
<li>IS 875. Characteristics loads.</li>
</ul>
</div>
</div>
<div id="outline-container-orgc53fa75" class="outline-3">
<h3 id="orgc53fa75">[L3] Jan 10, Fri</h3>
<div class="outline-text-3" id="text-orgc53fa75">
<ul class="org-ul">
<li>Visit of different RCC structures within the academic area.</li>
<li>Discussion on structural components, dimensions, resisting actions and load path.</li>
<li>Refer to Chapter 1 of the textbook.</li>
</ul>
</div>
</div>
<div id="outline-container-org02562d4" class="outline-3">
<h3 id="org02562d4">[L4] Jan 15, Wed</h3>
<div class="outline-text-3" id="text-org02562d4">
<ul class="org-ul">
<li>Structural systems. Framed systems and their analysis. Typology of different components of structural systems.</li>
<li>Refer to Chapter 1 of the textbook.</li>
</ul>
</div>
</div>
<div id="outline-container-org08c7733" class="outline-3">
<h3 id="org08c7733">[L5] Jan 17, Fri</h3>
<div class="outline-text-3" id="text-org08c7733">
<ul class="org-ul">
<li>Analysis of composite sections. Calculation of neutral axis through equilibrium and moment of resistance.</li>
<li>Discussions based on a typical beam/column reinforcement cage. Functions of longitudinal and transverse rebars for beams and columns.</li>
<li>Concept of modular ratio.</li>
<li>Concept of neutral axis of homogeneous and heterogeneous sections.</li>
<li>Design philosophies; limit states of collapse and serviceability.</li>
<li>Refer to Chapter 3 of the textbook.</li>
</ul>
</div>
</div>
<div id="outline-container-org3c3c5bb" class="outline-3">
<h3 id="org3c3c5bb">[L6] Jan 22, Wed</h3>
<div class="outline-text-3" id="text-org3c3c5bb">
<ul class="org-ul">
<li>Introduction to IS 456.</li>
<li>Stress-strain behaviour of concrete.</li>
<li>Refer to Section 3 of IS 456.</li>
<li>Design of RC beams.</li>
<li>Concept of neutral axis of homogeneous and heterogeneous sections.</li>
<li>Assumptions in the behaviour of RC beams. Concept of balanced, under-reinforced and over-reinforced sections.</li>
<li>Analysis and design of singly-reinforced RC beams.</li>
</ul>
</div>
</div>
<div id="outline-container-org2c9c01c" class="outline-3">
<h3 id="org2c9c01c">[L7] Jan 24, Fri</h3>
<div class="outline-text-3" id="text-org2c9c01c">
<ul class="org-ul">
<li>Design of RC beams.</li>
<li>Consideration of over-reinforced sections.</li>
<li>Analysis and design of doubly-reinforced sections.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb4403b9" class="outline-3">
<h3 id="orgb4403b9">[L8] Jan 29, Wed</h3>
<div class="outline-text-3" id="text-orgb4403b9">
<ul class="org-ul">
<li><b>Assignment 1</b> given, due on 5 Feb. (<a href="https://drive.google.com/drive/folders/1YiNLh1W9SuXim8eYhemuWcap9eUwGCVb?usp=sharing">download from here</a>)</li>
<li>Failure modes of an RCC beam.</li>
<li>Design of RC beams under shear.</li>
</ul>
</div>
</div>
<div id="outline-container-orgffebb3d" class="outline-3">
<h3 id="orgffebb3d">[L9] Jan 31, Fri</h3>
<div class="outline-text-3" id="text-orgffebb3d">
<ul class="org-ul">
<li>Design of RC beams.</li>
<li>Consideration of T and L beams.</li>
<li>Provisions of the Code for design of RCC beams.</li>
</ul>
</div>
</div>
<div id="outline-container-org5fe42f0" class="outline-3">
<h3 id="org5fe42f0">[L10] Feb 05, Wed</h3>
<div class="outline-text-3" id="text-org5fe42f0">
<ul class="org-ul">
<li><b>Assignment 2</b> given, due on 12 Feb. (<a href="https://drive.google.com/drive/folders/1YiNLh1W9SuXim8eYhemuWcap9eUwGCVb?usp=sharing">download from here</a>)</li>
<li>Design of RC columns.</li>
</ul>
</div>
</div>
<div id="outline-container-org498fc33" class="outline-3">
<h3 id="org498fc33">[L11] Feb 07, Fri</h3>
<div class="outline-text-3" id="text-org498fc33">
<ul class="org-ul">
<li>Design of RC columns.</li>
</ul>
</div>
</div>
<div id="outline-container-org95288a3" class="outline-3">
<h3 id="org95288a3">[L12] Feb 12, Wed</h3>
<div class="outline-text-3" id="text-org95288a3">
<ul class="org-ul">
<li>Design of RC columns.</li>
</ul>
</div>
</div>
<div id="outline-container-org488f40c" class="outline-3">
<h3 id="org488f40c">[L13] Feb 14, Fri</h3>
<div class="outline-text-3" id="text-org488f40c">
<ul class="org-ul">
<li>Design of RC columns.</li>
</ul>
</div>
</div>
<div id="outline-container-org96d3b3d" class="outline-3">
<h3 id="org96d3b3d">[L14] Feb 19, Wed</h3>
<div class="outline-text-3" id="text-org96d3b3d">
<ul class="org-ul">
<li>Design of RC slabs.</li>
<li>Behavior of slab as a plate, torsion near supported edges. Different cases of supporting conditions.</li>
<li>One-way vs. two-way slab action.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd3e3240" class="outline-3">
<h3 id="orgd3e3240">[L15] Feb 21, Fri</h3>
<div class="outline-text-3" id="text-orgd3e3240">
<ul class="org-ul">
<li>Design of RC slabs.</li>
</ul>
</div>
</div>
<div id="outline-container-org316e2bc" class="outline-3">
<h3 id="org316e2bc">Feb 26, Wed - no class</h3>
<div class="outline-text-3" id="text-org316e2bc">
<ul class="org-ul">
<li>Maha Shivaratri</li>
</ul>
</div>
</div>
<div id="outline-container-org2a2c6e3" class="outline-3">
<h3 id="org2a2c6e3">[L16] Feb 28, Fri</h3>
<div class="outline-text-3" id="text-org2a2c6e3">
<ul class="org-ul">
<li>Design of RC slabs.</li>
</ul>
</div>
</div>
<div id="outline-container-org0543b48" class="outline-3">
<h3 id="org0543b48">Mar 1 - 7: Mid semester exam week</h3>
</div>
<div id="outline-container-orgdd2844f" class="outline-3">
<h3 id="orgdd2844f">Mar 8 - 16: Mid semester recess</h3>
</div>
<div id="outline-container-org609c66f" class="outline-3">
<h3 id="org609c66f">[L17] Mar 19, Wed</h3>
<div class="outline-text-3" id="text-org609c66f">
<ul class="org-ul">
<li>Design of shallow foundations.</li>
<li>Types of footings. Eccentricity. Failure modes and design considerations.</li>
</ul>
</div>
</div>
<div id="outline-container-orge8a8996" class="outline-3">
<h3 id="orge8a8996">[L18] Mar 21, Fri</h3>
<div class="outline-text-3" id="text-orge8a8996">
<ul class="org-ul">
<li>Design of shallow foundations.</li>
</ul>
</div>
</div>
<div id="outline-container-org9c008d9" class="outline-3">
<h3 id="org9c008d9">[L19] Mar 26, Wed</h3>
<div class="outline-text-3" id="text-org9c008d9">
<ul class="org-ul">
<li>Design of shallow foundations.</li>
</ul>
</div>
</div>
<div id="outline-container-org8d35e39" class="outline-3">
<h3 id="org8d35e39">[L20] Mar 28, Fri</h3>
<div class="outline-text-3" id="text-org8d35e39">
<ul class="org-ul">
<li>Design of staircases.</li>
</ul>
</div>
</div>
<div id="outline-container-org668bddc" class="outline-3">
<h3 id="org668bddc">[L21] Apr 02, Wed</h3>
<div class="outline-text-3" id="text-org668bddc">
<ul class="org-ul">
<li>Design of staircases.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd7f80a3" class="outline-3">
<h3 id="orgd7f80a3">[L22] Apr 04, Fri</h3>
<div class="outline-text-3" id="text-orgd7f80a3">
<ul class="org-ul">
<li>Design of staircases.</li>
</ul>
</div>
</div>
<div id="outline-container-org30add8c" class="outline-3">
<h3 id="org30add8c">[L23] Apr 09, Wed</h3>
<div class="outline-text-3" id="text-org30add8c">
<ul class="org-ul">
<li>Detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-org41cf95c" class="outline-3">
<h3 id="org41cf95c">[L24] Apr 11, Fri</h3>
<div class="outline-text-3" id="text-org41cf95c">
<ul class="org-ul">
<li>Detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-org7dbbfac" class="outline-3">
<h3 id="org7dbbfac">[L25] Apr 16, Wed</h3>
<div class="outline-text-3" id="text-org7dbbfac">
<ul class="org-ul">
<li>Detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-org34ae19e" class="outline-3">
<h3 id="org34ae19e">Apr 18, Fri - no class</h3>
<div class="outline-text-3" id="text-org34ae19e">
<ul class="org-ul">
<li>Good Friday</li>
</ul>
</div>
</div>
<div id="outline-container-org387c0e6" class="outline-3">
<h3 id="org387c0e6">[L26] Apr 23, Wed</h3>
<div class="outline-text-3" id="text-org387c0e6">
<ul class="org-ul">
<li>Detailing and construction practices.</li>
</ul>
</div>
</div>
<div id="outline-container-org6e61b90" class="outline-3">
<h3 id="org6e61b90">Apr 24 - 30: End semester exam week</h3>
</div>
</div>
</div>
<div id="postamble" class="status">

<footer>
Contact: 
<a href='mailto:gauravs@iitgn.ac.in'>gauravs@iitgn.ac.in</a> (Work) |
<a href='mailto:it.gaurav@gmail.com'>it.gaurav@gmail.com</a> (Personal)
<br>
Created completely through <a href='https://www.gnu.org/software/emacs/'>Gnu Emacs</a> and <a href='https://orgmode.org'>Org Mode</a> (<a href='https://github.com/gaurav-iitgn/gaurav-iitgn.github.io'>source code</a>)
</footer>
</div>
</body>
</html>
